Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་གལ་ཏེ་ནང་སྟོང་པ་ཉིད་རང་བཞིན་གྱིས་སྟོང་པ་མ་ཡིན་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་པར་མི་འགྱུར་རོ། །གལ་ཏེ་ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། སྟོང་པ་ཉིད་སྟོང་པ་ཉིད་དང་། ཆེན་པོ་སྟོང་པ་ཉིད་དང་། དོན་དམ་པ་སྟོང་པ་ཉིད་དང་། འདུས་བྱས་སྟོང་པ་ཉིད་དང་། འདུས་མ་བྱས་སྟོང་པ་ཉིད་དང་། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དང་། ཐོག་མ་དང་ཐ་མ་མེད་པ་སྟོང་པ་ཉིད་དང་། དོར་བ་མེད་པ་སྟོང་པ་ཉིད་དང་། རང་བཞིན་སྟོང་པ་ཉིད་དང་། ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་དང་། རང་གི་མཚན་ཉིད་སྟོང་པ་ཉིད་དང་། མི་དམིགས་པ་སྟོང་པ་ཉིད་དང་།
en: Subhūti, if the emptiness of internal phenomena were not empty of inherent existence, bodhisattva great beings would indeed not teach the Dharma that all phenomena are empty of inherent existence.

source: དངོས་པོ་མེད་པ་སྟོང་པ་ཉིད་དང་། ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རང་བཞིན་གྱིས་སྟོང་པ་ཡིན་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཀྱང་ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་ངོ་ཞེས་བྱ་བར་ཆོས་སྟོན་པར་མི་འགྱུར་ཏེ། དེའི་ཕྱིར་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་བཤིག་པར་འགྱུར་ན།
en: If the emptiness of external phenomena, the emptiness of both external and internal phenomena, the emptiness of emptiness, the emptiness of great extent, the emptiness of ultimate reality, the emptiness of conditioned phenomena, the emptiness of unconditioned phenomena, the emptiness of the unlimited, the emptiness of that which has neither beginning nor end, the emptiness of nonexclusion, the emptiness of inherent existence, the emptiness of all phenomena, the emptiness of intrinsic defining characteristics, the emptiness of nonapprehensibility, the emptiness of nonentities, the emptiness of essential nature, and the emptiness of the essential nature of nonentities were not empty of inherent existence, bodhisattva great beings would indeed not teach the Dharma that all phenomena are empty of inherent existence, and for that reason even the emptiness of inherent existence would collapse. “

source: རང་བཞིན་སྟོང་པ་ཉིད་ནི་འཇིག་པར་མི་འགྱུར། རྟག་པར་མ་ཡིན་ཏེ། ཕྱིས་མེད་པར་འགྲོ་བ་མ་ཡིན་ནོ།
en: However, the emptiness of inherent existence will neither collapse, nor will it endure eternally, nor will it go away in the future.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་ཡུལ་ན་མི་གནས། ཕྱོགས་ན་མི་གནས་པ་སྟེ། དེ་ནི་གང་ནས་ཀྱང་འོང་བ་མ་ཡིན། གང་དུ་ཡང་འགྲོ་བ་མ་ཡིན་ཏེ། དེ་ནི་ཆོས་གནས་པ་ཉིད་དོ། །དེ་ལ་ནི་ཆོས་གང་ཡང་འཕེལ་བ།
en: If you ask why, it is because it does not dwell in any location, it does not dwell in any direction, it does not arise from anywhere, and it does not go anywhere. {

source: དམིགས་པ་འམ། འགྲིབ་པ་དམིགས་པ་འམ།
en: Ki.

source: འགོད་པ་འམ།
en: VIII: 97} It is the abiding nature of all phenomena.

source: སྐྱེ་བ་འམ། འབྱུང་བ་འམ། འགག་པ་འམ། ཀུན་ནས་ཉོན་མོངས་པ་འམ། རྣམ་པར་བྱང་བ་དམིགས་པ་མེད་དོ།
en: In it there is nothing at all that is perceived to be enhanced or perceived to be diminished, and nothing that is perceived to arise, originate, cease, be afflicted, or be purified.

source: །དེ་ནི་ཆོས་རྣམས་ཀྱི་རང་བཞིན་ཏེ།
en: It is the natural expression of all phenomena. “

source: དེ་ལ་གནས་ཤིང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་འཇུག་སྟེ། ཆོས་གང་ཡང་འཇུག་པ་འམ། མི་འཇུག་པར་མཐོང་བ་མེད་དོ།
en: Abiding in it, bodhisattva great beings engage in unsurpassed, complete enlightenment, and yet they do not see anything at all in which they would engage or not engage.

source: །ཆོས་ཐམས་ཅད་ནི་འཇུག་པ་མེད་ཅིང་གནས་པ་མེད་པ་སྟེ།
en: All phenomena are not to be engaged and are nondwelling.

source: དེ་ནི་ཆོས་རྣམས་ཀྱི་ཆོས་གནས་པའོ།
en: This is the abiding nature of all phenomena.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པར་མཐོང་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་གོ །
en: Therefore, when bodhisattva great beings practice the perfection of wisdom, they see that all phenomena are empty of inherent existence, and they do not turn back from unsurpassed, complete enlightenment.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེས་སྒྲིབ་པའི་ཆོས་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: If you ask why, it is because they do not observe anything at all that is obscured thereby.

source: ཆོས་ཐམས་ཅད་ནི་སྒྲིབ་པ་མེད་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: That is to say, they observe that all phenomena are without obscuration.

source: །དེ་ནི་འདི་ལྟར་རང་བཞིན་སྟོང་པ་ཉིད་ལ་བདག་མི་དམིགས། བདག་ཏུ་བཏགས་པ་ཡང་མི་དམིགས་སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་།
en: This is because in the emptiness of inherent existence, self is not apprehensible, and even the concept of self is not apprehensible.

source: ཚོར་བར་བྱེད་པ་པོ་དང་། སློང་བ་པོ་དང་། ཀུན་ནས་སློང་བ་པོ་དང་། ཤེས་པ་པོ་དང་། མཐོང་བ་པོར་ཡང་མི་དམིགས།
en: Sentient beings, life forms, living beings, life, living creatures, individual personalities, human beings, people, actors, experiencers, instigators of experience, petitioners, instigators, knowers, and viewers are also not apprehensible, and even the concept of viewers [and so forth] is not apprehensible. “

source: མཐོང་བ་པོར་བཏགས་པ་ཡང་མི་དམིགས། གཟུགས་ཀྱང་མི་དམིགས། གཟུགས་སུ་བཏགས་པ་ཡང་མི་དམིགས།
en: Physical forms are not apprehensible, and even the concept of physical forms is not apprehensible.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་མི་དམིགས། རྣམ་པར་ཤེས་པར་བཏགས་པ་ཡང་མི་དམིགས་སོ།
en: Feelings, perceptions, formative predispositions, and consciousness are not apprehensible, and even the concept of consciousness [and so forth] is not apprehensible. [

source: །མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཀྱི་བར་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡང་མི་དམིགས། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུར་བཏགས་པ་ཡང་མི་དམིགས་ན།
en: The attributes], up to and including the thirty-two major marks of a great person and the eighty excellent minor marks, are not apprehensible, and even the concept of the eighty excellent minor marks [and so forth] is not apprehensible.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཐེ་ཚོམ་ཟ་བར་འགྱུར་བ་ལྟ་ག་ལས་འོང་། རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན།
en: If that is the case, how could they possibly be consumed with doubt concerning unsurpassed, complete enlightenment! “

source: དེ་བཞིན་གཤེགས་པས་སྤྲུལ་པའི་དགེ་སློང་ངམ། དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་ལ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མར་རྒྱུན་དུ་ཆོས་བསྟན་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: Subhūti, if, for example, [the tathāgatas] were to teach the Dharma continuously for many hundred billion trillions of eons to monks, nuns, laymen, or laywomen emanated by the tathāgatas, do you think, Subhūti, that those phantom emanations could possibly have the good fortune to attain the fruit of entering the stream to nirvāṇa?

source: སྤྲུལ་པ་དེ་དག་ལ་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་རྗེས་སུ་འཐོབ་པར་འགྱུར་བའི་སྐལ་བ་ལྟ་ཡོད་དམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ། རང་བྱང་ཆུབ་བམ།
en: Could they have the good fortune to attain the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment?

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འཐོབ་པར་འགྱུར་བའི་སྐལ་པ་ཡོད་དམ། གསོལ་པ།
en: Could they have the good fortune to attain unsurpassed, complete enlightenment?” “

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟར་དེ་དག་ལ་དངོས་པོ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: And if one were to ask why, it is because these are not entities.” “

source: ཆོས་ཐམས་ཅད་ལ་དངོས་པོ་མེད་ན། སེམས་ཅན་གང་ཞིག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འམ། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འམ། དགྲ་བཅོམ་པ་ཉིད་དམ།
en: If all phenomena are nonentities, what beings should bodhisattva great beings establish in the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, or unsurpassed, complete enlightenment? {

source: རང་བྱང་ཆུབ་བམ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འགོད་པར་བྱ་སྟེ།
en: Ki.

source: གཞན་དུ་ན་ཕྱིན་ཅི་ལོག་གིས་ཡོངས་སུ་འཁྲིས་པའི་སྐྱེས་བུ་དག་ཕྱིན་ཅི་ལོག་མེད་པ་ལ་གཞོག་གོ །འདུལ་ལོ། །རབ་ཏུ་འགོད་དོ། །ཕྱིན་ཅི་ལོག་གང་ཡིན་པ་དེ་ཡང་རྟོག་པའི་རྒྱུ་ལས་བྱུང་བའི་ཕྱིར། ཕྱིན་ཅི་ལོག་མ་ཡིན་པ་སྟེ།
en: VIII: 98} On the other hand, living creatures ensnared by erroneous views may be settled, disciplined, and established in nonerroneous views, in which case those erroneous views are not actually erroneous because they have originated [merely] from the causal basis of false imaginations.

source: རྣམ་པར་རྟོག་པ་མེད་པ་ནི་ཕྱིན་ཅི་ལོག་མ་ཡིན་པའོ།
en: The absence of false imaginations is nonerroneous.

source: །གང་ལ་ཕྱིན་ཅི་ལོག་མེད་པ་དེ་ལ་བདག་མེད་དོ། །སེམས་ཅན་མེད་དོ། །སྲོག་མེད་དོ། །འགྲོ་བ་མེད་དོ། །གསོ་བ་མེད་དོ། །སྐྱེས་བུ་མེད་དོ། །གང་ཟག་མེད་དོ། །ཤེད་ཅན་མེད་དོ། །ཤེད་བདག་མེད་དོ། །བྱེད་པ་པོ་མེད་དོ། །ཚོར་བ་པོ་མེད་དོ། །ཤེས་པ་པོ་མེད་དོ། །མཐོང་བ་པོ་མེད་དོ།
en: Where there are no erroneous views, there is no self, and there are no beings, no life forms, no living beings, no life, no living creatures, no individual personalities, no human beings, no people, no actors, no experiencers, no knowers, and no viewers.

source: །དེ་ལ་གཟུགས་མེད་དོ། །ཚོར་བ་མེད་དོ། །འདུ་ཤེས་མེད་དོ། །འདུ་བྱེད་མེད་དོ། །རྣམ་པར་ཤེས་པ་མེད་དོ།
en: In it there are no physical forms, no feelings, no perceptions, no formative predispositions, and no consciousness.

source: །དེ་ལ་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་རྣམས་མེད་དོ། །དེ་ལ་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་དང་།
en: In it there are no sense fields, sensory elements, or links of dependent origination.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མེད་དོ། །དེ་ལ་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: In it there are no perfections, aspects of emptiness, or factors conducive to enlightenment.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་མེད་དོ།
en: In it there are no truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, emptiness, signlessness, wishlessness, extrasensory powers, meditative stabilities, or dhāraṇī gateways.

source: །དེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་མེད་དོ།
en: In it there are no ten powers of the tathāgatas, four fearlessnesses, four kinds of exact knowledge, great loving kindness, great compassion, or eighteen distinct qualities of the buddhas.

source: །དེ་ལ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མེད་དོ། །གང་ལ་གཟུགས་མེད་པ་དང་། ཚོར་བ་མེད་པ་དང་། འདུ་ཤེས་མེད་པ་དང་། འདུ་བྱེད་མེད་པ་དང་། རྣམ་པར་ཤེས་པ་མེད་པ་དང་། གང་ལ་སྐྱེ་མཆེད་དང་། ཁམས་དང་།
en: In it there are no [goals], up to and including all-aspect omniscience.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མེད་པ་དང་། གང་ལ་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མེད་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་མེད་པ་དེ་ནི་རང་བཞིན་སྟོང་པ་ཉིད་དེ། །དེ་ལ་གནས་ཤིང་།
en: That in which there are no physical forms, no feelings, no perceptions, no formative predispositions, no consciousness, no sense fields, no sensory elements, no links of dependent origination, no perfections, no aspects of emptiness, no factors conducive to enlightenment, and no [fruitional attributes or goals], up to and including all-aspect omniscience, is the emptiness of inherent existence.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་རྣམས། སེམས་ཅན་གྱི་འདུ་ཤེས་ལས་འགྲེལ་ཏེ། གཟུགས་ཀྱི་འདུ་ཤེས་ལས་འགྲེལ་ཏོ། །གཟུགས་མེད་པའི་འདུ་ཤེས་པ་ལས་འགྲེལ་ཏོ། །ཟག་པ་དང་བཅས་པའི་ཆོས་ཐམས་ཅད་ཀྱི་བར་ལས་འགྲེལ་ཏོ།
en: Abiding in it, bodhisattva great beings practice the perfection of wisdom, and while practicing the perfection of wisdom, they liberate erroneous beings from the notion that there are beings, they liberate them from the notion of form, they liberate them from the notion of formlessness, and they liberate them from [all else], up to and including the notion that all phenomena are contaminated. “

source: །གང་ཟག་པ་མེད་པའི་ཆོས་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་པོ་དེ་དག་ཀྱང་དེ་ལ་དོན་དམ་པའི་རྣམ་པ་གང་ཡིན་པ་དེ་ལྟ་བུ་མ་ཡིན་ཏེ།
en: As for phenomena that are uncontaminated—comprising the factors conducive to enlightenment, the three gateways to liberation, the four truths of the noble ones, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, all the meditative stabilities, all the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas—they too do not exist as such from the point of view of ultimate reality.

source: དེ་ལྟར་འདུས་མ་བྱས་པ་དང་། མ་སྐྱེས་པ་དང་། དངོས་པོ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་འདི་ནི་རང་བཞིན་སྟོང་པ་ཉིད་དོ།
en: For these unconditioned and nonarising nonentities, devoid of origination, constitute the emptiness of inherent existence.

source: །དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་སྟེ། དེ་ལ་བདག་མེད་དོ། །སེམས་ཅན་དང་། སྲོག་དང་། སྐྱེ་བ་པོ་དང་། གསོ་བ་དང་། སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་ཤེས་པ་པོ་དང་། མཐོང་བ་པོ་མེད་དོ།
en: This is the enlightenment of the lord buddhas, wherein there is no self, no being, no life form, no living being, no life, no living creature, no individual personality, no human being, no person, no actor, no experiencer, no knower, and no viewer.

source: །གཟུགས་མེད་དོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མེད་དོ། །སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མེད་དོ།
en: In it there are no physical forms, no feelings, no perceptions, no formative predispositions, and no consciousness; no sense fields, sensory elements, or links of dependent origination; no perfections, aspects of emptiness, or factors conducive to enlightenment; and no [fruitional attributes or goals], up to and including all-aspect omniscience. “

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་མེད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་མེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་གཞན་དུ་ན་རང་བཞིན་སྟོང་པ་ཉིད་ཡོངས་སུ་ཤེས་པ་ལས་ལམ་གྱི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་འཇུག་པ་མེད་དེ།
en: Bodhisattva great beings do not set out for unsurpassed, complete enlightenment for the sake of any path other than comprehension of the emptiness of inherent existence.

source: རང་བཞིན་སྟོང་པ་ཉིད་དེ་ཡང་སྔ་ནས་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཕྱིན་ཆད་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་བར་དུ་ཡང་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་དེ།
en: This emptiness of inherent existence is indeed the emptiness of inherent existence with respect to the past, the emptiness of inherent existence with respect to the future, and the emptiness of inherent existence with respect to the intervening present.

source: དེ་ནམ་ཡང་རང་བཞིན་གྱིས་མི་སྟོང་པ་མ་ཡིན་ནོ།
en: It is never not empty of inherent existence.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Therefore, bodhisattva great beings practice the perfections, which are the emptiness of inherent existence, {Ki.

source: སེམས་ཅན་དུ་འདུ་ཤེས་པའི་སེམས་ཅན་རྣམས་ཀྱི། སེམས་ཅན་གྱི་འདུ་ཤེས་ཡོངས་སུ་དགྲོལ་བའི་ཕྱིར། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་སྤྱོད་དོ། །དེ་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟ་སྟེ།
en: VIII: 99} and they practice the knowledge of the path in order to liberate those beings who have the notion that they are beings from the notion that there are beings.

source: ཉན་ཐོས་ཀྱི་ལམ་དང་། རང་སངས་རྒྱས་ཀྱི་ལམ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལམ་དང་། ལམ་ཐམས་ཅད་ལ་སྤྱོད་དེ།
en: When they practice the knowledge of the path, they practice all paths, including the path of the śrāvakas, the path of the pratyekabuddhas, and the path of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལམ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱས་ནས། དེའི་ཚེའི་འདུ་བྱེད་བྱིན་གྱིས་བརླབས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: When bodhisattva great beings have perfected all those paths, brought beings to maturity, and refined the buddhafields, they are blessed with the formative predispositions conducive to longevity, and they will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་ཚུལ་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་རྒྱུན་མི་གཅོད་དོ།
en: When they have attained consummate buddhahood in unsurpassed, complete enlightenment, the way to buddhahood, the emptiness of inherent existence, is not interrupted. “

source: །དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཚུལ་ཏེ། འདས་པའི་དུས་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བྱུང་བ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཚུལ་ཡང་འདི་ལྟ་སྟེ། རང་བཞིན་སྟོང་པ་ཉིད་དོ།
en: As for the way to buddhahood followed by the lord buddhas, the way to buddhahood that all the lord buddhas who appeared in the past have followed is indeed the emptiness of inherent existence.

source: །མ་འོངས་པའི་དུས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བར་འགྱུར་བ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཚུལ་ཡང་འདི་ལྟ་སྟེ། རང་བཞིན་སྟོང་པ་ཉིད་དོ།
en: The way to buddhahood that all the lord buddhas who will appear in the future will follow is also the emptiness of inherent existence.

source: །ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་། འཚོ་སྐྱོང་བ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཚུལ་ཡང་འདི་ལྟ་སྟེ། རང་བཞིན་སྟོང་པ་ཉིད་དེ།
en: The way to buddhahood that all the lord buddhas follow who reside and are alive at the present time in the world systems of the ten directions is also the emptiness of inherent existence.

source: རང་བཞིན་སྟོང་པ་ཉིད་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མ་གཏོགས་པར་གཞན་ལས་འཇིག་རྟེན་དུ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Apart from the emptiness of inherent existence, there are no lord buddhas who will appear in the world.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱ་སྟེ།
en: So it is, Subhūti, that bodhisattva great beings should practice the perfections, which are the emptiness of inherent existence.

source: དེ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཡོངས་སུ་ཉམ་པར་མི་འགྱུར་རོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: Bodhisattva great beings who practice this will make irreversible progress toward all-aspect omniscience.”

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱིས་ཆོས་ཐམས་ཅད་ལ་སྤྱོད་ཅིང་གཟུགས་ཀྱང་གཞན་ནོ། །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་ནོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡང་གཞན་ནོ། །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་ནོ། །སྐྱེ་མཆེད་དང་།
en: Subhūti then said, “Blessed Lord, it is wonderful that bodhisattva great beings practice everything in that manner through the emptiness of inherent existence, and yet do not disrupt the emptiness of inherent existence [by holding] that physical forms are one distinct thing and the emptiness of inherent existence another; that feelings, perceptions, formative predispositions, and consciousness are distinct thing and the emptiness of inherent existence another; that the sense fields, sensory elements, and links of dependent origination are distinct things and the emptiness of inherent existence another; that the perfections, all the aspects of emptiness, and the factors conducive to enlightenment are distinct things and the emptiness of inherent existence another; that the truths of the noble ones, meditative concentrations, immeasurable attitudes, formless absorptions, aspects of liberation, serial steps of meditative absorption, emptiness, signlessness, wishlessness, extrasensory powers, meditative stabilities, and dhāraṇī gateways are distinct things and the emptiness of inherent existence another; that the ten powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas are distinct things and the emptiness of inherent existence another; and that [the goals], up to and including all-aspect omniscience, are distinct things and the emptiness of inherent existence another. {

source: ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་གཞན་ནོ།
en: Ki.

source: །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་ནོ། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཀྱང་གཞན་ནོ། །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་ནོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་གཞན་ནོ། །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་ནོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་གཞན་ནོ། །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་ནོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་གཞན་ནོ།
en: VIII: 100} Rather, they engage on the basis that physical forms are themselves the emptiness of inherent existence and the emptiness of inherent existence is also physical forms.

source: །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཞན་ནོ་ཞེས་བགྱི་བར་རང་བཞིན་སྟོང་པ་ཉིད་རྣམ་པར་འཁྲུག་པར་མི་བགྱིད་ཀྱི། གཟུགས་ཉིད་ཀྱང་རང་བཞིན་སྟོང་པ་ཉིད་དོ། །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་རང་བཞིན་སྟོང་པ་ཉིད་དོ།
en: Feelings, perceptions, formative predispositions, and consciousness are themselves the emptiness of inherent existence and the emptiness of inherent existence is also consciousness [and so forth]. [

source: །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་རང་བཞིན་སྟོང་པ་ཉིད་དོ། །རང་བཞིན་སྟོང་པ་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ་ཞེས་བགྱི་བར་སྤྱོད་པ་ངོ་མཚར་ཆེའོ།
en: The attributes and goals], up to and including all-aspect omniscience, are themselves the emptiness of inherent existence and the emptiness of inherent existence is also all-aspect omniscience [and so forth].” “

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: It is as you have said.
